package com.example.administrator.pet_go.Util;

/**
 * Created by Administrator on 2018/11/25/025.
 */

public class DataUtil {
//    public final static String host = "http://39.96.24.227:8080/PetGo";
    public final static String host = "http://10.27.194.15:8080";

    public final static int MATCHSTATE_INIT =  0; //初识状态
    public final static int MATCHSTATE_AGREE =  1; //同意
    public final static int MATCHSTATE_DISAGREE =  2; // 拒绝
    public final static int MATCHSTATE_YET =  3; //待定

    public final static String petData = "[{\"type\": \"宠物狗\", \"variety\": [\"边境牧羊犬\", \"博美犬\", \"柴犬\", \"腊肠犬\", \"杜宾犬\", \"德国牧羊犬\", \"柯基犬\", \"藏獒\", \"比熊犬\", \"雪纳瑞犬\", \"贵宾犬\", \"高加索犬\"]}, {\"type\": \"宠物猫\", \"variety\": [\"暹罗猫\", \"波斯猫\", \"挪威森林猫\", \"孟买猫\", \"英国短毛猫\", \"布偶猫\", \"土耳其梵猫\", \"山东狮子猫\", \"折耳猫\", \"缅因猫\", \"异国短毛猫\", \"新加坡猫\"]}, {\"type\": \"宠物鼠\", \"variety\": [\"仓鼠\", \"布丁仓鼠\", \"龙猫\", \"老婆婆仓鼠\", \"金狐仓鼠\", \"紫衣仓鼠\", \"奶茶仓鼠\", \"黑熊仓鼠\", \"熊猫仓鼠\", \"三线仓鼠\", \"纯白龙猫\", \"银狐仓鼠\"]}, {\"type\": \"宠物兔\", \"variety\": [\"伊拉兔\", \"荷兰垂耳兔\", \"荷兰侏儒兔\", \"迷你垂耳兔\", \"荷兰兔\", \"巨型安哥拉兔\", \"法国垂耳兔\", \"海棠兔\", \"巨型花明兔\", \"英国垂耳兔\", \"加利福尼亚兔\", \"比利时兔\"]}, {\"type\": \"观赏鱼\", \"variety\": [\"鹦鹉鱼\", \"龙鱼\", \"锦鲤鱼\", \"银龙鱼\", \"罗汉鱼\", \"孔雀鱼\", \"地图鱼\", \"小丑鱼\", \"斗鱼\", \"接吻鱼\", \"神仙鱼\", \"财神鱼\"]}, {\"type\": \"观赏鸟\", \"variety\": [\"百灵鸟\", \"暗绿绣眼鸟\", \"画眉鸟\", \"太平鸟\", \"相思鸟\", \"八哥鸟\", \"鹩哥\", \"虎皮鹦鹉\", \"金丝雀\", \"黄鹂\", \"云雀\", \"黄雀\"]}, {\"type\": \"观赏龟\", \"variety\": [\"缅甸陆龟\", \"黄头侧颈龟\", \"大鳄龟\", \"蛋龟\", \"火焰龟\", \"中华草龟\", \"鹰嘴龟\", \"猪鼻龟\", \"地图龟\", \"平背麝香龟\", \"玳瑁\", \"金钱龟\"]}, {\"type\": \"宠物蛇\", \"variety\": [\"赤练蛇\", \"喜玛拉雅白头蛇\", \"太攀蛇\", \"金环蛇\", \"眼镜王蛇\", \"玉米蛇\", \"水蚺蛇\", \"黑曼巴蛇\", \"黄金蟒\", \"网纹蟒\", \"球蟒\", \"蝮蛇\"]}, {\"type\": \"蜘蛛\", \"variety\": [\"智利火玫瑰\", \"泰国金属蓝\", \"红玫瑰蜘蛛\", \"巴西巨人金毛\", \"巴西红毛蜘蛛\", \"铁锈红巴布\", \"墨西哥火膝头\", \"海地咖啡食鸟蜘蛛\", \"泰国斑马脚\", \"墨西哥金背\", \"哥斯达黎加斑马脚\", \"秘鲁金铜\"]}, {\"type\": \"蜥蜴\", \"variety\": [\"鬃狮蜥\", \"绿鬣蜥\", \"中华石龙子\", \"中国水龙\", \"蝾螈\", \"四线石龙子\", \"火焰石龙子\", \"伞蜥\", \"犰狳蜥\", \"海鬣蜥\", \"新疆岩蜥\", \"盾甲蜥\"]}, {\"type\": \"鳄鱼\", \"variety\": [\"泰鳄\", \"凯门鳄\", \"侏儒凯门鳄\", \"湾鳄\", \"扬子鳄\", \"印度鳄\", \"尼罗鳄\"]}, {\"type\": \"宠物猴\", \"variety\": [\"松鼠猴\", \"狨猴\", \"指猴\", \"懒猴\", \"金丝猴\", \"日本袖珍石猴\", \"狐猴\", \"眼镜猴\", \"猕猴\", \"婴猴\", \"赤猴\", \"白面僧帽猴\"]}, {\"type\": \"宠物猪\", \"variety\": [\"小香猪\", \"越南大肚猪\", \"胡利亚尼猪\", \"麝香猪\", \"香猪\"]}, {\"type\": \"狐狸\", \"variety\": [\"蓝狐\", \"银狐\", \"大耳狐\", \"南非狐\", \"藏狐\", \"银黑狐\", \"阿富汗狐\", \"沙狐\", \"敏狐\", \"吕佩尔狐\", \"孟加拉狐\", \"彩狐\"]}, {\"type\": \"松鼠\", \"variety\": [\"欧洲红松鼠\", \"岩松鼠\", \"雪地松鼠\", \"长吻松鼠\", \"黄山松鼠\", \"土拔鼠\"]}, {\"type\": \"宠物貂\", \"variety\": [\"貂\", \"蒙眼貂\", \"东方色貂\", \"火焰色貂\", \"香槟色貂\", \"黑眼雪貂\", \"红眼雪貂\"]}]";
}
